## Using outer join to select actors

In [25]:
import os
from pathlib import Path
import re

import pandas as pd

In [2]:
DATAPATH = Path('data').absolute()

In [3]:
actors_movies = pd.read_csv(DATAPATH / "actors_movies.csv")
actors_movies.head()

                                               Actor                   Title
0  [Emil Eifrem,Hugo Weaving,Laurence Fishburne,C...              The Matrix
1  [Hugo Weaving,Laurence Fishburne,Carrie-Anne M...     The Matrix Reloaded
2  [Hugo Weaving,Laurence Fishburne,Carrie-Anne M...  The Matrix Revolutions
3           [Al Pacino,Charlize Theron,Keanu Reeves]    The Devil's Advocate
4  [James Marshall,Kevin Pollak,J.T. Walsh,Aaron ...          A Few Good Men

In [4]:
actors_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Actor   35 non-null     object
 1   Title   35 non-null     object
dtypes: object(2)
memory usage: 688.0+ bytes

In [5]:
actors_movies.Title.str.lower()

0                          the matrix
1                 the matrix reloaded
2              the matrix revolutions
3                the devil's advocate
4                      a few good men
5                             top gun
6                       jerry maguire
7                         stand by me
8                  as good as it gets
9                what dreams may come
10             snow falling on cedars
11                    you've got mail
12               sleepless in seattle
13             joe versus the volcano
14                  that thing you do
15                   the replacements
16                         rescuedawn
17                       the birdcage
18                         unforgiven
19                    johnny mnemonic
20                        cloud atlas
21                  the da vinci code
22                     v for vendetta
23                        speed racer
24                     ninja assassin
25                     the green mile
26                              hoffa
27                          apollo 13
28                          cast away
29    one flew over the cuckoo's nest
30             something's gotta give
31                   bicentennial man
32               charlie wilson's war
33                  the polar express
34              a league of their own
Name: Title, dtype: object

In [6]:
movies = pd.read_pickle(DATAPATH / "movies.p")
movies.head()

      id                 title  popularity release_date
0    257          Oliver Twist   20.415572   2005-09-23
1  14290  Better Luck Tomorrow    3.877036   2002-01-12
2  38365             Grown Ups   38.864027   2010-06-24
3   9672              Infamous    3.680896   2006-11-16
4  12819       Alpha and Omega   12.300789   2010-09-17

### Exercise 2.3.1 Merging a table to itself

In [7]:
sequels = pd.read_pickle(DATAPATH / "sequels.p")
sequels.head()

      id         title  sequel
0  19995        Avatar    <NA>
1    862     Toy Story     863
2    863   Toy Story 2   10193
3    597       Titanic    <NA>
4  24428  The Avengers    <NA>

In [8]:
sequels.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4803 entries, 0 to 4802
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4803 non-null   Int64
 1   title   4803 non-null   object
 2   sequel  90 non-null     Int64
dtypes: Int64(2), object(1)
memory usage: 122.1+ KB

In [9]:
crews = pd.read_pickle(DATAPATH / "crews.p")
crews.head()

      id  department             job               name
0  19995     Editing          Editor  Stephen E. Rivkin
2  19995       Sound  Sound Designer  Christopher Boyes
4  19995  Production         Casting          Mali Finn
6  19995   Directing        Director      James Cameron
7  19995     Writing          Writer      James Cameron

In [10]:
crews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 42502 entries, 0 to 129580
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          42502 non-null  int64
 1   department  42502 non-null  object
 2   job         42502 non-null  object
 3   name        42502 non-null  object
dtypes: int64(1), object(3)
memory usage: 1.6+ MB

In [11]:
# Merge the crews table to itself
crews_self_merged = crews.merge(crews, on='id', how='inner', suffixes=('_dir','_crew'))
crews_self_merged.head()

,id,department_dir,job_dir,name_dir,department_crew,job_crew,name_crew
0,19995,Editing,Editor,Stephen E. Rivkin,Editing,Editor,Stephen E. Rivkin
1,19995,Editing,Editor,Stephen E. Rivkin,Sound,Sound Designer,Christopher Boyes
2,19995,Editing,Editor,Stephen E. Rivkin,Production,Casting,Mali Finn
3,19995,Editing,Editor,Stephen E. Rivkin,Directing,Director,James Cameron
4,19995,Editing,Editor,Stephen E. Rivkin,Writing,Writer,James Cameron

In [12]:
crews_self_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 834194 entries, 0 to 834193
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id               834194 non-null  int64
 1   department_dir   834194 non-null  object
 2   job_dir          834194 non-null  object
 3   name_dir         834194 non-null  object
 4   department_crew  834194 non-null  object
 5   job_crew         834194 non-null  object
 6   name_crew        834194 non-null  object
dtypes: int64(1), object(6)
memory usage: 50.9+ MB

### Self join

**Merging a table to itself can be useful when we want to compare values in a column to other values in the same column.** We will create a table that for each movie will list the movie director and a member of the crew on one row. We have been given a table called crews, which has columns `id`, `job`, and `name`. First, we merge the table to itself using the movie ID. This merge will give us a larger table where for each movie, every job is matched against each other. Then we select only those rows with a director in the left table, and avoid having a row where the director's job is listed in both the left and right tables. This filtering will remove job combinations that aren't with the director.

In [13]:
# Create a boolean index to select the appropriate rows
boolean_filter = ((crews_self_merged['job_dir'] == 'Director') & 
                  (crews_self_merged['job_crew'] != 'Director'))

direct_crews = crews_self_merged[boolean_filter]
direct_crews.head()

,id,department_dir,job_dir,name_dir,department_crew,job_crew,name_crew
156,19995,Directing,Director,James Cameron,Editing,Editor,Stephen E. Rivkin
157,19995,Directing,Director,James Cameron,Sound,Sound Designer,Christopher Boyes
158,19995,Directing,Director,James Cameron,Production,Casting,Mali Finn
160,19995,Directing,Director,James Cameron,Writing,Writer,James Cameron
161,19995,Directing,Director,James Cameron,Art,Set Designer,Richard F. Mays

By merging the table to itself, we compared the value of the director from the jobs column to other values from the jobs column. With the output, we can quickly see different movie directors and the people they worked with in the same movie.

## Section 2.3 Merging on indexes
### Exercise 2.3.1 Index merge for movie ratings

To practice merging on indexes, you will merge `movies` and a table called `ratings` that holds info about movie ratings. Make sure your merge returns all of the rows from the `movies`table and not all the rows of `ratings` table need to be included in the result.

In [14]:
ratings = pd.read_pickle(DATAPATH / "ratings.p")
ratings.head()

       id  vote_average  vote_count
0   19995           7.2     11800.0
1     285           6.9      4500.0
2  206647           6.3      4466.0
3   49026           7.6      9106.0
4   49529           6.1      2124.0

In [15]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4803 entries, 0 to 4802
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            4803 non-null   int64
 1   vote_average  4803 non-null   float64
 2   vote_count    4741 non-null   float64
dtypes: float64(2), int64(1)
memory usage: 112.7 KB

In [16]:
# Merge to the movies table the ratings table on the index
movies_ratings = movies.merge(ratings, left_index=True, right_index=True, how='left')
movies_ratings.head()

,id_x,title,popularity,release_date,id_y,vote_average,vote_count
0,257,Oliver Twist,20.415572,2005-09-23,19995,7.2,11800.0
1,14290,Better Luck Tomorrow,3.877036,2002-01-12,285,6.9,4500.0
2,38365,Grown Ups,38.864027,2010-06-24,206647,6.3,4466.0
3,9672,Infamous,3.680896,2006-11-16,49026,7.6,9106.0
4,12819,Alpha and Omega,12.300789,2010-09-17,49529,6.1,2124.0

### Exercise 2.4.2 Do sequels earn more?
<p>It is time to put together many of the aspects that you have learned in this chapter. In this exercise, you'll find out which movie sequels earned the most compared to the original movie. To answer this question, you will merge a modified version of the <code>sequels</code> and <code>financials</code> tables where their index is the movie ID. You will need to choose a merge type that will return all of the rows from the <code>sequels</code> table and not all the rows of <code>financials</code> table need to be included in the result. From there, you will join the resulting table to itself so that you can compare the revenue values of the original movie to the sequel. Next, you will calculate the difference between the two revenues and sort the resulting dataset. </p><p>The <code>sequels</code> and <code>financials</code> tables have been provided.</p>

#### Instructions

<ul><li>With the <code>sequels</code> table on the left, merge to it the <code>financials</code> table on index named <code>id</code>, ensuring that all the rows from the <code>sequels</code> are returned and some rows from the other table may not be returned, Save the results to <code>sequels_fin</code>.</li></ul>

In [17]:
financials = pd.read_pickle(DATAPATH / "financials.p")
financials.head()

       id     budget       revenue
0   19995  237000000  2.787965e+09
1     285  300000000  9.610000e+08
2  206647  245000000  8.806746e+08
3   49026  250000000  1.084939e+09
4   49529  260000000  2.841391e+08

In [18]:
# Merge sequels and financials on index id
sequels_fin = (sequels
               .merge(financials, how='left', left_index=True, right_index=True, suffixes=('', '_y'))
               .drop('id_y', axis=1)
               .set_index('id'))
sequels_fin.head()

              title  sequel       budget       revenue
id
19995        Avatar    <NA>  237000000.0  2.787965e+09
862       Toy Story     863  300000000.0  9.610000e+08
863     Toy Story 2   10193  245000000.0  8.806746e+08
597         Titanic    <NA>  250000000.0  1.084939e+09
24428  The Avengers    <NA>  260000000.0  2.841391e+08

In [19]:
# Self merge with suffixes as inner join with left on sequel and right on id
orig_seq = sequels_fin.merge(sequels_fin, how='inner', left_on='sequel', 
                             right_on='id', right_index=True,
                             suffixes=('_org','_seq'))
orig_seq.head()

,sequel,title_org,sequel_org,budget_org,revenue_org,title_seq,sequel_seq,budget_seq,revenue_seq
id,,,,,,,,,
862,863,Toy Story,863,300000000.0,9.610000e+08,Toy Story 2,10193,245000000.0,8.806746e+08
863,10193,Toy Story 2,10193,245000000.0,8.806746e+08,Toy Story 3,<NA>,380000000.0,1.045714e+09
675,767,Harry Potter and the Order of the Phoenix,767,200000000.0,7.837663e+08,Harry Potter and the Half-Blood Prince,<NA>,200000000.0,1.215440e+09
121,122,The Lord of the Rings: The Two Towers,122,200000000.0,1.025491e+09,The Lord of the Rings: The Return of the King,<NA>,255000000.0,8.928991e+07
120,121,The Lord of the Rings: The Fellowship of the Ring,121,190000000.0,1.506249e+09,The Lord of the Rings: The Two Towers,122,200000000.0,1.025491e+09

In [20]:
# Add calculation to subtract revenue_org from revenue_seq 
orig_seq['diff'] = orig_seq['revenue_seq'] - orig_seq['revenue_org']

# Select the title_org, title_seq, and diff 
titles_diff = orig_seq[['title_org','title_seq','diff']]
titles_diff.sort_values(by='diff', ascending=False).head()

,title_org,title_seq,diff
id,,,
3049,Ace Ventura: Pet Detective,Ace Ventura: When Nature Calls,1.039243e+09
8966,Twilight,The Twilight Saga: New Moon,6.775028e+08
10138,Iron Man 2,Iron Man 3,6.579765e+08
61791,Rise of the Planet of the Apes,Dawn of the Planet of the Apes,5.895793e+08
331,Jurassic Park III,Jurassic World,5.578606e+08

# 3. Advanced Merging and Concatenating

In this chapter, you'll leverage powerful filtering techniques, including semi-joins and anti-joins. You’ll also learn how to glue DataFrames by vertically combining and using the pandas.concat function to create new datasets. Finally, because data is rarely clean, you’ll also learn how to validate your newly combined data structures.

Tags: semi-join, anti-join.

In [33]:
for f in os.listdir(DATAPATH):
    print(f)
    df = pd.read_csv(DATAPATH / f) if f.endswith('.csv') else pd.read_pickle(DATAPATH / f)
    print(df.head())

actors_movies.csv
                                               Actor                   Title
0  [Emil Eifrem,Hugo Weaving,Laurence Fishburne,C...              The Matrix
1  [Hugo Weaving,Laurence Fishburne,Carrie-Anne M...     The Matrix Reloaded
2  [Hugo Weaving,Laurence Fishburne,Carrie-Anne M...  The Matrix Revolutions
3           [Al Pacino,Charlize Theron,Keanu Reeves]    The Devil's Advocate
4  [James Marshall,Kevin Pollak,J.T. Walsh,Aaron ...          A Few Good Men
business_owners.p
  account first_name  last_name      title
0      10      PEARL    SHERMAN  PRESIDENT
1      10      PEARL    SHERMAN  SECRETARY
2   10002     WALTER     MROZEK    PARTNER
3   10002     CELINA     BYRDAK    PARTNER
4   10005      IRENE  ROSENFELD  PRESIDENT
casts.p
    movie_id  cast_id character  gender    id               name
7          5       22   Jezebel       1  3122        Sammi Davis
8          5       23     Diana       1  3123  Amanda de Cadenet
9          5       24    Athena       1  3124     Valeria Golino
3          5       25   Elspeth       1  3125            Madonna
12         5       26       Eva       1  3126          Ione Skye
census.p
  ward  pop_2000  pop_2010 change                                  address  \
0    1     52951     56149     6%              2765 WEST SAINT MARY STREET
1    2     54361     55805     3%                 WM WASTE MANAGEMENT 1500
2    3     40385     53039    31%                      17 EAST 38TH STREET
3    4     51953     54589     5%  31ST ST HARBOR BUILDING LAKEFRONT TRAIL
4    5     55302     51455    -7%  JACKSON PARK LAGOON SOUTH CORNELL DRIVE

     zip
0  60647
1  60622
2  60653
3  60653
4  60637
crews.p
      id  department             job               name
0  19995     Editing          Editor  Stephen E. Rivkin
2  19995       Sound  Sound Designer  Christopher Boyes
4  19995  Production         Casting          Mali Finn
6  19995   Directing        Director      James Cameron
7  19995     Writing          Writer      James Cameron
cta_calendar.p
   year  month  day        day_type
0  2019      1    1  Sunday/Holiday
1  2019      1    2         Weekday
2  2019      1    3         Weekday
3  2019      1    4         Weekday
4  2019      1    5        Saturday
cta_ridership.p
  station_id  year  month  day  rides
0      40010  2019      1    1    576
1      40010  2019      1    2   1457
2      40010  2019      1    3   1543
3      40010  2019      1    4   1621
4      40010  2019      1    5    719
financials.p
       id     budget       revenue
0   19995  237000000  2.787965e+09
1     285  300000000  9.610000e+08
2  206647  245000000  8.806746e+08
3   49026  250000000  1.084939e+09
4   49529  260000000  2.841391e+08
land_use.p
  ward  residential  commercial  industrial  vacant  other
0    1           41           9           2       2     46
1    2           31          11           6       2     50
2    3           20           5           3      13     59
3    4           22          13           0       7     58
4    5           25           3           1       3     68
licenses.p
  account ward  aid                   business               address    zip
0  307071    3  743       REGGIE'S BAR & GRILL       2105 S STATE ST  60616
1      10   10  829                 HONEYBEERS   13200 S HOUSTON AVE  60633
2   10002   14  775                CELINA DELI     5089 S ARCHER AVE  60632
3   10005   12  NaN  KRAFT FOODS NORTH AMERICA        2005 W 43RD ST  60609
4   10044   44  638  NEYBOUR'S TAVERN & GRILLE  3651 N SOUTHPORT AVE  60613
movies.p
      id                 title  popularity release_date
0    257          Oliver Twist   20.415572   2005-09-23
1  14290  Better Luck Tomorrow    3.877036   2002-01-12
2  38365             Grown Ups   38.864027   2010-06-24
3   9672              Infamous    3.680896   2006-11-16
4  12819       Alpha and Omega   12.300789   2010-09-17
movie_to_genres.p
   movie_id            genre
0         5            Crime
1         5           Comedy
2        11  Science Fiction
3        11           Action
4        11        Adventure
ratings.p
       id  vote_average  vote_count
0   19995           7.2     11800.0
1     285           6.9      4500.0
2  206647           6.3      4466.0
3   49026           7.6      9106.0
4   49529           6.1      2124.0
S&P500.csv
   Date  Returns
0  2008   -38.49
1  2009    23.45
2  2010    12.78
3  2011     0.00
4  2012    13.41
sequels.p
      id         title  sequel
0  19995        Avatar    <NA>
1    862     Toy Story     863
2    863   Toy Story 2   10193
3    597       Titanic    <NA>
4  24428  The Avengers    <NA>
stations.p
  station_id        station_name                 location
0      40010  Austin-Forest Park  (41.870851, -87.776812)
1      40020         Harlem-Lake  (41.886848, -87.803176)
2      40030        Pulaski-Lake  (41.885412, -87.725404)
3      40040        Quincy/Wells   (41.878723, -87.63374)
4      40050               Davis   (42.04771, -87.683543)
taglines.p
       id                                         tagline
0   19995                     Enter the World of Pandora.
1     285  At the end of the world, the adventure begins.
2  206647                           A Plan No One Escapes
3   49026                                 The Legend Ends
4   49529            Lost in our world, found in another.
taxi_owners.p
     rid   vid           owner                 address    zip
0  T6285  6285  AGEAN TAXI LLC     4536 N. ELSTON AVE.  60630
1  T4862  4862    MANGIB CORP.  5717 N. WASHTENAW AVE.  60659
2  T1495  1495   FUNRIDE, INC.     3351 W. ADDISON ST.  60618
3  T4231  4231    ALQUSH CORP.   6611 N. CAMPBELL AVE.  60645
4  T5971  5971  EUNIFFORD INC.     3351 W. ADDISON ST.  60618
taxi_vehicles.p
    vid    make   model  year fuel_type                owner
0  2767  TOYOTA   CAMRY  2013    HYBRID       SEYED M. BADRI
1  1411  TOYOTA    RAV4  2017    HYBRID          DESZY CORP.
2  6500  NISSAN  SENTRA  2019  GASOLINE       AGAPH CAB CORP
3  2746  TOYOTA   CAMRY  2013    HYBRID  MIDWEST CAB CO, INC
4  5922  TOYOTA   CAMRY  2013    HYBRID       SUMETTI CAB CO
ward.p
  ward            alderman                          address    zip
0    1  Proco "Joe" Moreno        2058 NORTH WESTERN AVENUE  60647
1    2       Brian Hopkins       1400 NORTH  ASHLAND AVENUE  60622
2    3          Pat Dowell          5046 SOUTH STATE STREET  60609
3    4    William D. Burns  435 EAST 35TH STREET, 1ST FLOOR  60616
4    5  Leslie A. Hairston            2325 EAST 71ST STREET  60649
WorldBank_GDP.csv
    Country Name Country Code     Indicator Name  Year           GDP
0          China          CHN  GDP (current US$)  2010  6.087160e+12
1        Germany          DEU  GDP (current US$)  2010  3.417090e+12
2          Japan          JPN  GDP (current US$)  2010  5.700100e+12
3  United States          USA  GDP (current US$)  2010  1.499210e+13
4          China          CHN  GDP (current US$)  2011  7.551500e+12
WorldBank_POP.csv
  Country Name Country Code     Indicator Name  Year         Pop
0        Aruba          ABW  Population, total  2010    101669.0
1  Afghanistan          AFG  Population, total  2010  29185507.0
2       Angola          AGO  Population, total  2010  23356246.0
3      Albania          ALB  Population, total  2010   2913021.0
4      Andorra          AND  Population, total  2010     84449.0
zip_demo.p
     zip  income
0  60630   70122
1  60640   50488
2  60622   87143
3  60614  100116
4  60608   41226